package MODEL.Findings;

public class FaistosDisc extends RareFinding{
    public FaistosDisc(){
        super("Ανακάλυψες το Δίσκο της Φαιστού!!!", "findings/diskos.jpg", 35, "Ο Δίσκος της Φαιστού είναι ένα αρχαιολογικό εύρημα από τη Μινωική πόλη της Φαιστού"+
                " στη νότια Κρήτη και χρονολογείται πιθανώς στον 17ο αιώνα π.Χ.. Αποτελεί ένα από τα γνωστότερα μυστήρια της αρχαιολογίας,"+
                " αφού ο σκοπός της κατασκευής του και το νόημα των όσων αναγράφονται σε αυτόν παραμένουν άγνωστα. Ο δίσκος ανακαλύφθηκε στις 3 Ιουλίου 1908" +
                " από τον Ιταλό αρχαιολόγο Λουίτζι Περνιέ (Luigi Pernier) και φυλάσσεται σήμερα στο Αρχαιολογικό Μουσείο Ηρακλείου.");
    }
}
