package MODEL.Findings;

public class GoddessOfSnakes extends Statue{
    public GoddessOfSnakes(){
        super("Βρήκες ένα άγαλμα της Θεάς των Φιδιών!!!", "findings/snakes.jpg", 1,
                "Ως η θεά με τα φίδια ονομάζεται ο τύπος αγαλματίδιου που βρέθηκε σε ανασκαφές στους Μινωικούς αρχαιολογικούς τόπους που παρουσιάζει γυναίκα να κρατάει φίδια."+
                        " Τα αγαλματίδα χρονολογούνται στον 16ο αιώνα π.Χ.. Λίγες πληροφορίες έχουμε για την ερμηνεία των αγαλματιδίων."+
                        " Ο Έβανς συνδέει την θεά των όφεων με την Αιγυπτιακή θεά Ουατζέτ. Είναι προπομπός της κρητικής Ρέας και παρουσιάζει μεγάλη ομοιότητα με την φρυγική Κυβέλη και την εφεσία Αρτέμιδα.");
    }
}
