package MODEL.Findings;

public class RingOfMinoa extends RareFinding{
    public RingOfMinoa(){
        super("Ανακάλυψες το Δαχτυλίδι του Μίνωα !!!", "findings/ring.jpg", 25,
                "Το «Δαχτυλίδι του Μίνωα», ένα από τα μεγαλύτερα και σπανιότερα χρυσά σφραγιδικά στον κόσμο,"+
                        " θεωρείται από τα καλύτερα δείγματα της κρητομυκηναϊκής σφραγιδικής. Φέρει σύνθετη θρησκευτική παράσταση,"+
                        " που απεικονίζει μορφές οι οποίες εντάσσονται στην κρητομυκηναϊκή θεματολογία, δεντρολατρία με καθιστή θεά,"+
                        " ουρανό, γη και θάλασσα, με ιερό πλοίο που έχει μορφή ιππόκαμπου.");
    }
}
