package MODEL.Findings;

public class RytoZakro extends RareFinding{
    public RytoZakro(){
        super("Ανακάλυψες το Ρυτό της Ζάκρου!!!", "findings/ruto.jpg", 25,
                "Το αγγείο βρέθηκε στο θησαυροφυλάκιο του ανακτόρου της Ζάκρου μαζί με άλλα μοναδικά στο είδος τους"+
                        " τελετουργικά σκεύη της νεοανακτορικής εποχής και αποτελεί χαρακτηριστικό παράδειγμα"+
                        " της εφευρετικότητας και καλαισθησίας των Μινωιτών τεχνιτών.");
    }
}
