package MODEL.Findings;

public class TheLiliesPrince extends Fresco{
    public TheLiliesPrince(){
        super("Φωτογράφισες την Τοιχογραφία: Ο πρίγκιπας με τα κρίνα", "findings/fresco4_20.jpg", 20,
                "Εικονίζεται επιβλητική ανδρική μορφή, που βαδίζει προς τα αριστερά σε απροσδιόριστο ερυθρό φόντο."+
                        " Φοράει το τυπικό μινωικό περίζωμα με φαρδιά ζώνη, περιδέραιο στο λαιμό και πλούσιο κάλυμμα κεφαλής διακοσμημένο με κρίνα και φτερά παγωνιού."+
                        " Η στάση των χεριών του δείχνει ότι ίσως έσερνε με το αριστερό του χέρι ένα ζώο ή κάποιο μυθικό τέρας, γρύπα ή σφίγγα."+
                        " Ο νέος ονομάσθηκε από τους ερευνητές «πρίγκηπας», γιατί θεωρήθηκε ότι αποδίδει το βασιλιά-ιερέα, που ζούσε στο ανάκτορο της Κνωσού.!!!");
    }
}
