package MODEL.Findings;

public class TheParisian extends Fresco{
    public TheParisian(){
        super("Φωτογράφισες την Τοιχογραφία: Η παριζιάνα!!!", "findings/fresco6_15.jpg", 15,
                "Εικονίζεται μια γυναίκα αριστοκρατικής καταγωγής σε θέση προφίλ."+
                        " Ονομάστηκε «Παριζιάνα» από τον Άρθουρ Έβανς, γιατί το 1903 (έτος που ανακαλύφθηκε)"+
                        " τα μεγάλα μάτια, τα κατσαρά μαλλιά, τα έντονα κόκκινα χείλη και η ανασηκωμένη μύτη θεωρούνταν"+
                        " τα ιδεώδη της γυναικείας ομορφιάς, τα οποία μόνο μια όμορφη γυναίκα από … το Παρίσι μπορούσε να τα ενσαρκώσει.");
    }
}
